In [1]:
from bs4 import BeautifulSoup
import pandas as pd
import requests

In [2]:
page = requests.get('https://sos.ga.gov/elections/election_results/2010_0810/0031301.htm')
soup = BeautifulSoup(page.text, 'html.parser')

In [3]:
table = soup.find_all("table")[2]

In [4]:
df = pd.read_html(str(table), flavor='bs4')

In [5]:
df = df[1]

In [6]:
df.shape

(9, 8)

In [7]:
df.head(5)

         0     1              2                 3               4   5   6   7
0      NaN   NaN  Crane  15,286  Honeycutt  7,349  Totals  22,635 NaN NaN NaN
1      NaN   NaN          67.5%             32.5%          100.0% NaN NaN NaN
2   County   PPR            NaN               NaN             NaN NaN NaN NaN
3  CLAYTON  100%           2464              1250            3714 NaN NaN NaN
4     COBB  100%           6568              3425            9993 NaN NaN NaN

In [8]:
df = df[3:]

In [9]:
df.head(5)

         0     1     2     3     4   5   6   7
3  CLAYTON  100%  2464  1250  3714 NaN NaN NaN
4     COBB  100%  6568  3425  9993 NaN NaN NaN
5   DEKALB  100%    37    20    57 NaN NaN NaN
6  DOUGLAS  100%  3516  1693  5209 NaN NaN NaN
7   FULTON  100%  1065   261  1326 NaN NaN NaN

In [10]:
df = df[df.columns[[0,2,3]]]

In [11]:
df.head(5)

         0     2     3
3  CLAYTON  2464  1250
4     COBB  6568  3425
5   DEKALB    37    20
6  DOUGLAS  3516  1693
7   FULTON  1065   261

In [12]:
df.columns = ['county', 'Mike Crane', 'Deborah Honeycutt']

In [13]:
df.tail(5)

    county Mike Crane Deborah Honeycutt
4     COBB       6568              3425
5   DEKALB         37                20
6  DOUGLAS       3516              1693
7   FULTON       1065               261
8    HENRY       1636               700

In [14]:
df = df.melt(id_vars=['county'])

In [15]:
df.columns = ['county', 'candidate', 'votes']

In [16]:
df.head()

    county   candidate votes
0  CLAYTON  Mike Crane  2464
1     COBB  Mike Crane  6568
2   DEKALB  Mike Crane    37
3  DOUGLAS  Mike Crane  3516
4   FULTON  Mike Crane  1065

In [17]:
df['votes'] = df['votes'].astype(int)

In [18]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12 entries, 0 to 11
Data columns (total 3 columns):
county       12 non-null object
candidate    12 non-null object
votes        12 non-null int64
dtypes: int64(1), object(2)
memory usage: 368.0+ bytes

In [19]:
df['office'] = 'U.S. Representative'

In [20]:
df['district'] = '13'

In [21]:
df['party'] = 'Republican'

In [22]:
df.groupby(['candidate', 'party'])['votes'].sum()

candidate          party
Deborah Honeycutt  Republican     7349
Mike Crane         Republican    15286
Name: votes, dtype: int64

In [23]:
df[['county', 'office', 'district', 'party', 'candidate', 'votes']].head()

    county               office district       party   candidate  votes
0  CLAYTON  U.S. Representative       13  Republican  Mike Crane   2464
1     COBB  U.S. Representative       13  Republican  Mike Crane   6568
2   DEKALB  U.S. Representative       13  Republican  Mike Crane     37
3  DOUGLAS  U.S. Representative       13  Republican  Mike Crane   3516
4   FULTON  U.S. Representative       13  Republican  Mike Crane   1065

In [24]:
df[['county', 'office', 'district', 'party', 'candidate', 'votes']].to_clipboard(index=False, sep=',')